import React, { useState } from 'react';
import { useLocation } from 'react-router-dom';

export const Results = () => {
  const [selectedLocations, setSelectedLocations] = useState([]);
  const [setSelectedKind] = useState([]);
  const [filter, setFilter] = useState('');
  const routeLocation = useLocation();
  const { jsonData } = routeLocation.state;
  console.log(jsonData['result']);
  const jsonArray = jsonData['result'];
  const r2 = jsonData['r2']
  console.log(jsonArray);

  console.log(jsonData)
  const districtDict = {"לא ידוע":["לא רשום"],
  "עכו":["כמאנה","אבירים","אבו סנאן","אדמית","עדי","אפק","אחיהוד","עכו","עמקה","עראמשה","ערב אל נעים","עראבה","אשרת","עצמון שגב","עבדון","אבטליון","בית ג'ן","בן עמי","בית העמק","בצת","בענה","ביר אל-מכסור","בוסתן הגליל","דייר אל-אסד","דייר חנא","דמיידה","עין אל-אסד","אילון","אלקוש","עין המפרץ","עין יעקב","אשחר","אתגר","אבן מנחם","עברון","פסוטה","געתון","גשר הזיו","גילון","גיתה","גורן","גורנות הגליל","חלוץ","חניתה","הררית","חרשים","הילה","חוסן","חוג'ייראת","חורפיש","חוסנייה","אעבלין","ג'דיידה-מכר","ג'דיידה מאכר","ג'ולס","כברי","כאבול","כפר מנדא","כפר יאסיף","כמון","כאוכב אבו אל-היג'א","כרמיאל","כפר מסריק","כפר ראש הנקרה","ראש הנקרה","כפר רוזנואלד","כפר ורדים","כליל","כישור","כסרא-סמיע","כסרא","לפידות","לבון","כפר לימן","לוחמי הגיטאות","לוטם","מעלות-תרשיחא","מג'ד אל-כרום","מנוף","מנות","מתת","מזרעה","מצובה","מעונה","מעיליא","מכמנים","מצפה אבי\"ב","מורן","מורשת","אשבל","נהריה","נחף","נס עמים","נתיב השיירה","נטועה","נווה זיו","פלך","בוקייעה","פקיעין","פקיעין","קורנית","ראמה","רקפת","ראס אל-עין","רגבה","סער","סאג'ור","סח'נין","סלמה","סואעד","סואעד","שעב","שמרת","שבי ציון","שפרעם","שייח' דנון","שכניה","שלומי","שתולה","שזור","שומרה","שורשים","טל-אל","טמרה","תובל","יעד","יערה","יאנוח-ג'ת","יסעור","יחיעם","ירכא","יודפת","יובלים","צוריאל","צורית","צביה"],
  "חברון":["סנסנה","חברון","אדורה","אספר","אשכולות","חגי","כרמי צור","כרמל","מעון","מצדות יהודה","נגוהות","עתניאל","פני חבר","קרית ארבע","שמעה","סוסיה","תלם","טנא"],
  "באר שבע":["קצר א-סר","אעצם","אבו עבדון","אבו עמאר","אבו עמרה","אבו ג'ווייעד","אבו קרינאת","אבו קורינאת","אבו רובייעה","אבו רוקייק","אבו סריחאן","אבו תלול","אפיניש","אל סייד","עלומים","עמיעוז","ערערה-בנגב","ערד","אסד","אשלים","עטאוונה","אטרש","אבשלום","באר מילכה","באר אורה","באר שבע","בארי","באר גנים","בני נצרים","ברוש","בית הגדי","בית קמה","ביר הדאג'","בטחה","דקל","דריג'את","דימונה","דביר","אילת","אליפז","אילות","עין גדי","עין הבשור","עין השלושה","עין חצבה","עין תמר","עין יהב","אשבול","אשל הנשיא","עזוז","גרופית","גבעות בר","גבולות","גילת","גבעולים","הר עמשא","הוואשלה","חצרים","חצבה","חולית","חורה","הוזייל","עידן","עיר אובות","ג'נאביב","כפר מימון","כמהין","כרמים","כרם שלום","כיסופים","כחלה","כסיפה","להב","לקיה","להבים","לוטן","מעגלים","מבועים","מגן","צוקים","מחנה טלי","מחנה יפה","מחנה יתיר","מחנה יוכבד","מכחול","מסעודין אל-עזאזמה","משאבי שדה","מסלול","מלילות","מרחב עם","מיתר","מדרשת בן גוריון","משמר הנגב","מבטחים","מצפה רמון","שיטים","נצאצרה","נווה","נאות הכיכר","נתיבות","נבטים","נווה חריף","נווה זוהר","ניר עקיבא","ניר משה","ניר עוז","ניר יצחק","נירים","ניצנה","ניצני סיני","קדש ברנע","אופקים","אוהד","עומר","פעמי-תש\"ז","פארן","פטיש","פדויים","פרי גן","קבועה","קוואעין","קלחים","קטורה","קודייראת א-צאנע","רהט","רנן","רעים","רתמים","רביבים","רוח מדבר","סעד","סעוה","סמר","ספיר","סייד","שדה אברהם","שדה בוקר","שדה ניצן","שדה צבי","שגב-שלום","שחרות","שלווה במדבר","שני","שרשרת","שבי דרום","שיזף","שיבולים","נאות סמדר","שלומית","שומריה","שוקדה","שובל","שובה","סופה","תלמי בילו","תלמי אליהו","תלמי יוסף","תראבין א-צאנע","תראבין א-צאנע","תאשור","תל שבע","טללים","תקומה","תדהר","תפרח","תושיה","אום בטין","עוקבי","אורים","יהל","יתד","ירוחם","ישע","יבול","יושיביה","יטבתה","זבארגה","צאלים","זרועה","זמרת","צופר","צוחר","יזרעם"],
  "ירושלים":["אבו גוש","אדרת","עגור","עמינדב","אביעזר","בר גיורא","בקוע","בית מאיר","בית נקופה","בית שמש","בית זית","דייר ראפאת","עין נקובא","עין ראפה","עין כרם-בי\"ס חקלאי","אשתאול","איתנים","אבן ספיר","גפן","גבעת שמש","גבעת יערים","גבעת ישעיהו","גבעות עדן","גיזו","הראל","ירושלים","כפר אוריה","כפר זוהרים","כסלון","שריגים","לוזית","מעלה החמישה","מחסיה","מטע","מסילת ציון","מבשרת ציון","מבוא ביתר","מוצא עילית","נחם","נחשון","נטף","נחושה","נס הרים","נתיב הל\"ה","נווה אילן","נווה מיכאל","נווה שלום","אורה","קרית ענבים","קרית יערים","קרית יערים","רמת רחל","רמת רזיאל","שדות מיכה","שואבה","שורש","תעוז","טל שחר","תרום","תירוש","יד השמונה","ידידה","ישעי","צפרירים","זנוח","זכריה","צלפון","צרעה","צובה","צור הדסה"],
  "פתח תקווה":["עדנים","ברקת","בארות יצחק","בני עטרות","בית ברל","אליעד","אלישמע","עינת","אייל","גן חיים","גני עם","גני תקווה","גת רימון","גבעת השלושה","גבעת חן","גבעת ח\"ן","גבעת כח","גבעת כ\"ח","גבעת שמואל","חגור","הוד השרון","חורשים","ג'לג'וליה","כפר ברא","כפר קאסם","כפר מל\"ל","כפר סבא","כפר סירקין","כוכב יאיר","כפר מעש","מגשימים","מתן","מזור","נחשונים","נחלים","נווה ימין","נווה ירק","ניר אליהו","נירית","נופך","פתח תקווה","רעננה","רמת הכובש","רמות השבים","רינתיה","ראש העין","סביון","שדי חמד","שדה ורבורג","כפר וורבורג","טירת יהודה","ירחיב","ירקונה","יהוד-מונוסון","צופית","צור נתן","צור יצחק"],
  "עפולה":["אדירים","עפולה","אחוזת ברק","אלון הגליל","אלוני אבא","אלונים","אביטל","בלפוריה","ברק","בסמת טבעון","בית אלפא","בית השיטה","בית לחם הגלילית","בית רימון","בית שאן","בית שערים","בית יוסף","בית זיד","דבוריה","דחי","דליה","דברת","דבורה","אליקים","עין דור","עין העמק","עין הנצי\"ב","עין חרוד מאוחד","עין חרוד","עין חרוד איחוד","עין השופט","גלעד","גדיש","גן נר","גזית","גבע","גבת","גדעונה","גיניגר","גבעת אלה","גבעת עוז","חמדיה","חנתון","הרדוף","הסוללים","היוגב","הזורע","חפציבה","חבר","הושעיה","אכסאל","כפר ברוך","כפר גדעון","כפר החורש","כפר רופין","כפר יחזקאל","כפר יהושע","מעלה גלבוע","מעוז חיים","מגן שאול","מחנה יהודית","מגידו","מלאה","מירב","מרחביה","מרחביה","מסילות","מיטל","מיטב","מדרך עוז","מגדל העמק","משמר העמק","מצפה נטופה","מזרע","מולדת","מוקייבלה","נאעורה","נהלל","ניין","נווה איתן","נווה אור","ניר דוד","ניר יפה","נורית","אומן","פרזון","רם און","רם-און","רמת דוד","רמת השופט","רמת ישי","רמת צבי","רמות מנשה","רחוב","רשפים","רוויה","צנדלה","שריד","שדה אליהו","שדה נחום","שדי תרומות","שדה יעקב","שלוחות","שבלי - אום אל-גנם","שמשית","סולם","טמרה","טייבה","תל עדשים","תל תאומים","תל יוסף","תמרת","טירת צבי","יעל","ירדנה","יפעת","יזרעאל","יקנעם עילית","יקנעם","זרזיר","ציפורי","גבעת עדה","גניגר"],
  "גולן":["אפיק","אלוני הבשן","אניעם","אבני איתן","בני יהודה","בוקעאתא","עין קנייא","אלרום","אלי-עד","עין זיוון","גשור","ע'ג'ר","גבעת יואב","חד-נס","חספין","כנף","כפר חרוב","מעלה גמלא","מג'דל שמס","מסעדה","מרום גולן","מבוא חמה","מיצר","נטור","נאות גולן","נווה אטי\"ב","נמרוד","נוב","אודם","אורטל","קצרין","קלע","קשת","קדמת צבי","רמת מגשימים","רמות","שעל","רמת טראמפ","יונתן"],
  "כנרת":["אפיקים","אלמגור","אלומות","אמנון","ארבל","אשדות יעקב איחוד","אשדות יעקב מאוחד","אשדות יעקב","בית קשת","בית זרע","דגניה א'","דגניה ב'","עיילבון","עין גב","גשר","גינוסר","גבעת אבני","חמאם","האון","חזון","הזורעים","הודיות","חוקוק","אילניה","כדורי","כפר כמא","כלנית","כרי דשא","כרכום","כפר חיטים","כפר קיש","כפר תבור","כפר זיתים","מושבת כנרת","כנרת","לביא","לבנים","מעגן","מסד","מסדה","מנחמיה","מגדל","מצפה","מגאר","פוריה","פוריה עילית","פוריה - כפר עבודה","פוריה - נווה עובד","קדרים","רביד","שדה אילן","שער הגולן","שדמות דבורה","שרונה","טפחות","תל קציר","טבריה","יבנאל","יבניאל"],
  "אשקלון":["אחווה","אחוזם","אל-עזי","אלומה","אמציה","ערוגות","אשדוד","אשקלון","אביגדור","עזריקם","בת הדר","באר טוביה","ברכיה","ברור חיל","בית עזרא","בית גוברין","בית ניר","בית שקמה","ביצרון","בני דקלים","דורות","אליאב","אמונים","עין צורים","ארז","איתן","אבן שמואל","עזר","גלאון","גת","גיאה","גברעם","גבים","גבעתי","חצב","חצור-אשדוד","חצור","חלץ","הודיה","איבים","כנות","כרמי קטיף","מתחם כרמיה","כרמיה","כפר אחים","כפר עזה","כפר הרי\"ף","כפר מנחם","כפר סילבר","כפר ורבורג","כוכב מיכאל","לכיש","לכיש44","מחנה מרים","משען","משואות יצחק","מבקיעים","מפלסים","מנוחה","מרכז שפירא 144","מרכז שפירא","נחל עוז","נחלה","נגבה","נהורה","נטע","נתיב העשרה","נווה מבטח","ניר עם","ניר בנים","ניר ח\"ן","ניר ישראל","ניצן","ניצן ב'","ניצנים","נועם","נוגה","אור הנר","אורות","עוצם","קדמה","קרית גת","ברורים","קרית מלאכי","קוממיות","רבדים","רווחה","רוחמה","שדה דוד","שדה משה","שדה עוזיהו","שדה יואב","שדרות","סגולה","שפיר","שחר","שלווה","שקף","שתולים","תלמי יפה","תלמי יחיאל","תלמים","תימורים","עוזה","ורדון","יד מרדכי","יד נתן","יכיני","ינון","זבדיאל","זרחיה","זיקים","זוהר","חוות השיקמים","א/ת דרומי אשקלון","מבחור"],
  "רמלה":["אחיעזר","אחיסמך","עזריה","באר יעקב","בן שמן","בן שמן","בית עריף","בית דגן","בית חשמונאי","בית נחמיה","בית עוזיאל","גני הדר","גנות","גזר","גמזו","גימזו","גינתון","חדיד","חמד","חולדה","כרמי יוסף","כפר בן נון","בן נון","כפר דניאל","כפר חב\"ד","כפר רות","כפר שמואל","כפר טרומן","כרם בן שמן","לפיד","לוד","מצליח","מבוא מודיעים","משמר איילון","משמר דוד","משמר השבעה","מודיעין-מכבים-רעות","נען","נצר סרני","ניר צבי","נוף איילון","פדיה","פתחיה","רמלה","רמות מאיר","שעלבים","שילת","שהם","סתריה","יד רמב\"ם","יד רמבם","יגל","ישרש","יציץ","צפריה","זיתן"],
  "השרון":["אחיטוב","ארסוף","אביחיל","עזריאל","בחן","בת חפר","בת חן","בצרה","בארותיים","בני דרור","בני ציון","בית הלוי","בית חירות","בית ינאי","בית יהושוע","בית יהושע","בית יצחק-שער חפר","בית יצחק","ביתן אהרן","ביתן אהרון","בורגתה","אליכין","אלישיב","עין החורש","עין שריד","עין ורד","אבן יהודה","געש","גן יאשיה","גנות הדר","גאולי תימן","גאולים","גבעת חיים איחוד","גבעת חיים","גבעת שפירא","הדר עם","המעפיל","חניאל","העוגן","חרוצים","חבצלת השרון","חרב לאת","בית חרות","חרות","חיבת ציון","חופית","חגלה","כפר עבודה","כפר הרא\"ה","כפר הרואה","כפר חיים","כפר הס","כפר מונאש","כפר נטר","כפר ויתקין","כפר יעבץ","כפר יונה","מעברות","מבואות ים","מדרשת רופין","מכמורת","משמר השרון","משמרת","נעורים","נתניה","ניצני עוז","נורדיה","עולש","אמץ","פרדסיה","פורת","קדימה","צורן","קלנסווה","קרית שלמה","רשפון","שער אפריים","שער אפרים","שפיים","שושנת העמקים","צוקי ים","טייבה","תל מונד","תל יצחק","תנובות","טירה","אודים","יד חנה","ינוב","יקום","יעף","כפר ידידיה","זמר","צור משה"],"חדרה":["אל-עריאן","אלוני יצחק","עמיקם","ערערה","עתלית","אביאל","באקה אל-גרביה","ברקאי","בסמ\"ה","בת שלמה","בית חנניה","בית אורן","בית צבי","בנימינה","דור","עין חוד","עין איילה","עין הוד","עין עירון","עין כרמל","עין שמר","פוריידיס","פורדיס","גן שומרון","גן שמואל","גבע כרמל","גבעת ניל\"י","הבונים","חדרה","החותרים","חריש","ג'ת","ג'סר א-זרקא","כפר קרע","כפר גליקסון","כפר פינס","כרם מהר\"ל","להבות חביבה","מעגן מיכאל","מעלה עירון","מענית","מאור","מעין צבי","מגל","מי עמי","מי-עמי","מאיר שפיה","מגדים","מייסר","מצר","משמרות","מצפה אילן","נחשולים","נווה אבות","נווה ים","ניר עציון","עופר","אור עקיבא","פרדס חנה","פרדס חנה-כרכור","קציר","קיסריה","רגבים","שדה יצחק","שדות ים","שער מנשה","תלמי אליעזר","אום אל-פחם","אום אל-קוטוף","צרופה","זכרון יעקב"],
  "טול כרם":["עלי זהב","אלפי מנשה","אריאל","אבני חפץ","ברקן","ברוכין","אלקנה","ענב","עמנואל","כפר תפוח","נופים","אורנית","פדואל","קרני שומרון","קדומים","קרית נטפים","סלעית","שער שומרון","יקיר","צופים"],
  "בית לחם":["אלון שבות","בת עין","ביתר עילית","אפרת","אלעזר","הר גילה","כפר עציון","מעלה אדומים","מעלה עמוס","מגדל עוז","נווה דניאל","נוקדים","קדר","ראש צורים","תקוע"],
  "צפת":["עלמה","עמיר","אמירים","עמיעד","עמוקה","אביבים","איילת השחר","בר יוחאי","ברעם","בית הלל","ביריה","דפנה","דלתון","דן","דישון","דוב\"ב","אליפלט","גדות","גונן","הגושרים","חצור הגלילית","חולתה","ג'ש","גוש חלב","כדיתה","כחל","כפר בלום","כפר גלעדי","כפר חנניה","כפר הנשיא","כפר חושן","כפר שמאי","כפר סאלד","כרם בן זמרה","כורזים","להבות הבשן","מעיין ברוך","מעין ברוך","מחניים","מלכיה","מרגליות","מנרה","מירון","מטולה","משגב עם","משמר הירדן","נאות מורדכי","אור הגנוז","פרוד","קרית שמונה","רמות נפתלי","ריחאניה","ראש פינה","סאסא","בית אליעזר","שדה אליעזר","שדה נחמיה","שניר","שמיר","שאר ישוב","שפר","טובא-זנגריה","יסוד המעלה","יפתח","יראון","כפר יובל","יובל","צפת","צבעון","זרעית","ספסופה","ד.נ. גליל עליון"],
  "ירדן )יריחו(":["אלמוג","ארגמן","אבנת","בקעות","בית הערבה","גלגל","גיתית","חמרה","מעלה אפרים","משכיות","משואה","מחולה","מכורה","מבואות יריחו","מצפה שלם","מצפה יריחו","נערן","נערן/נירן","נעמה","חמדת","נתיב הגדוד","פצאל","קליה","רועי","רותם","שדמות מחולה","תומר","ורד יריחו","יפית","ייט\"ב","צמח","בקעת הירדן"],
  "ראמאללה":["עלמון","עמיחי","עטרת","בית אריה","בית אל","בית חורון","דולב","גני מודיעין","גבע בנימין","גבעת זאב","גבעון החדשה","הר אדר","חשמונאים","כפר אדומים","כפר האורנים","כוכב השחר","כוכב יעקב","מעלה לבונה","מעלה מכמש","מתתיהו","מבוא חורון","מודיעין","נעלה","נחליאל","נוה צוף","ניל\"י","עופרה","פסגות","רימונים","שילה","טלמון"],
  "רחובות":["עשרת","עיינות","מושב עיינות","בן זכאי","בניה","בני עי\"ש","בני עיש","בני דרום","בני רא\"ם","בני ראם","בית אלעזרי","בית גמליאל","בית חנן","בית חלקיה","בית עובד","בית רבן","גן הדרום","גן שלמה","קבוצת שילר","גן שורק","גן יבנה","גני טל","גני יוחנן","גאליה","גדרה","גיבתון","גבעת ברנר","חפץ חיים","אירוס","כפר אביב","כפר ביל\"ו","כפר הנגיד","כפר מרדכי","כרם ביבנה","מחנה הילה","מחנה תל נוף","מזכרת בתיה","מישר","גוש שגב - משגב","משגב דב","נס ציונה","נטעים","נצר חזני","ניר גלים","פלמחים","קבוצת יבנה","קדרון","קרית עקרון","רחובות","ראשון לציון","שדמה","יד בנימין","יבנה","יסודות","צופיה","צריפין"],
  "חולון":["אזור","בת ים","חולון","מקווה ישראל"],
  "רמת גן":["בני ברק","גבעתיים","אור יהודה","קרית אונו","רמת גן"],
  "שכם":["ברכה","עלי","אלון מורה","איתמר","מגדלים","רחלים","רבבה","שבי שומרון","יצהר"],
  "נצרת":["בועיינה-נוג'ידאת","עין מאהל","עילוט","כעביה-טבאש-חג'אג'רה","כפר כנא","כפר מצר","ח'ואלד","מנשית זבדה","משהד","נצרת","נוף הגליל","ריינה","רומת הייב","רומאנה","טורעאן","עוזייר","יפיע"],
  "חיפה":["דאלית אל-כרמל","חיפה","אבטין","עספיא","כפר ביאליק","כפר גלים","כפר המכבי","כפר הנוער הדתי","כפר חסידים","כפר חסידים א'","כפר חסידים ב'","ח'ואלד","נשר","נופית","אורנים","קרית אתא","קרית ביאליק","קרית מוצקין","קרית טבעון","קרית ים","רמת יוחנן","ראס עלי","רכסים","שער העמקים","טירת כרמל","אושה","יגור","גרנות"],
  "תל אביב":["גליל ים","הרצליה","כפר שמריהו","רמת השרון","תל אביב","יפו"],
  "ג'נין":["חרמש","חיננית","מבוא דותן","ריחן","שקד"]};
  console.log(Array.isArray(jsonArray));

  const handleLocationClick = (District) => {
    // Toggle the selection of the clicked District
    if (selectedLocations.includes(District)) {
      setSelectedLocations(selectedLocations.filter(item => item !== District)); // Remove District from the selectedLocations array
    } else {
      setSelectedLocations([...selectedLocations, District]); // Add District to the selectedLocations array
    }
  }
  
  const handleFilterChange = (e) => {
    setFilter(e.target.value); // Set the filter state based on the selected value
    setSelectedKind(null); // Reset selected kind when the filter changes
  };
  
  // Get unique location values from the jsonArray
  const uniqueLocations = [...new Set(jsonArray.map((row) => row.District))];
  
  // Get unique kind values from the jsonArray
  const uniqueKinds = [...new Set(jsonArray.map((row) => row.Food))];
  
  // Filter the jsonArray based on the selected filter (District or Food)
  const filteredData = jsonArray.filter((row) => {
    const filterMatch = row.District.includes(filter); // Check if the District matches the filter
    const kindmatch = row.Food.includes(filter); // Check if the Food matches the filter
    return filterMatch || kindmatch; // Return true if either District or Food matches the filter
  });
  
  return (
    <div className="ResultsPage">
      <h2 className="h2"> Results </h2>
      <div className="accuracy-info">
      The accuracy of this prediction is {r2.toFixed(2)}
    </div> Add this line
    <br></br>
      <div className="table-container">
        <table id="table" className="table">
          <thead>
            <tr>
              <th>
                District{' '}
                <select
                  value={filter}
                  onChange={handleFilterChange}
                  className="filter-dropdown"
                >
                  <option value="">הכל  </option>
                  {uniqueLocations.map((District) => (
                    <option key={District} value={District}>
                      {District}
                    </option>
                  ))}
                </select>
              </th>
              <th>
                Kind{' '}
                <select
                  value={filter}
                  onChange={handleFilterChange}
                  className="filter-dropdown"
                >
                  <option value="">הכל </option>
                  {uniqueKinds.map((Food) => (
                    <option key={Food} value={Food}>
                      {Food}
                    </option>
                  ))}
                </select>
              </th>
              <th>Prediction (Kg)</th>
            </tr>
          </thead>
          <tbody>
            {filteredData.map((row, index) => (
              <React.Fragment key={index}>
                <tr>
                  <td
                    className="location-cell"
                    onClick={() => handleLocationClick(row.District)}
                  >
                    {row.District}
                    {/* Display the dropdown content if the District is selected */}
                    {selectedLocations.includes(row.District) && (
                      <ul className="dropdown-content">
                        {districtDict[row.District].map((word, wordIndex) => (
                          <li key={wordIndex}>{word}</li>
                        ))}
                      </ul>
                    )}
                  </td>
                  <td>{row.Food}</td>
                  <td>{row.prediction}</td>
                </tr>
              </React.Fragment>
            ))}
          </tbody>
        </table>
      </div>
    </div>
  );
  };
  
  export default Results;
  
